runs/order-inventory__arm_b_spring__single__null-agent__t2__rep1__20260611T114530Z/logs/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ggalazzo/workspace/personal/recq-rigor-study/perf/order-inventory/workload.js
        output: -

     scenarios: (100.00%) 2 scenarios, 25 max VUs, 2m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 30s (gracefulStop: 5s)
              * load: 20 looping VUs for 2m0s (startTime: 30s, gracefulStop: 10s)


running (0m01.0s), 05/25 VUs, 45 complete and 0 interrupted iterations
warmup   [   3% ] 5 VUs    01.0s/30s
load   • [   0% ] waiting  29.0s

running (0m02.0s), 05/25 VUs, 90 complete and 0 interrupted iterations
warmup   [   7% ] 5 VUs    02.0s/30s
load   • [   0% ] waiting  28.0s

running (0m03.0s), 05/25 VUs, 135 complete and 0 interrupted iterations
warmup   [  10% ] 5 VUs    03.0s/30s
load   • [   0% ] waiting  27.0s

running (0m04.0s), 05/25 VUs, 180 complete and 0 interrupted iterations
warmup   [  13% ] 5 VUs    04.0s/30s
load   • [   0% ] waiting  26.0s

running (0m05.0s), 05/25 VUs, 230 complete and 0 interrupted iterations
warmup   [  17% ] 5 VUs    05.0s/30s
load   • [   0% ] waiting  25.0s

running (0m06.0s), 05/25 VUs, 275 complete and 0 interrupted iterations
warmup   [  20% ] 5 VUs    06.0s/30s
load   • [   0% ] waiting  24.0s

running (0m07.0s), 05/25 VUs, 320 complete and 0 interrupted iterations
warmup   [  23% ] 5 VUs    07.0s/30s
load   • [   0% ] waiting  23.0s

running (0m08.0s), 05/25 VUs, 365 complete and 0 interrupted iterations
warmup   [  27% ] 5 VUs    08.0s/30s
load   • [   0% ] waiting  22.0s

running (0m09.0s), 05/25 VUs, 415 complete and 0 interrupted iterations
warmup   [  30% ] 5 VUs    09.0s/30s
load   • [   0% ] waiting  21.0s

running (0m10.0s), 05/25 VUs, 460 complete and 0 interrupted iterations
warmup   [  33% ] 5 VUs    10.0s/30s
load   • [   0% ] waiting  20.0s

running (0m11.0s), 05/25 VUs, 505 complete and 0 interrupted iterations
warmup   [  37% ] 5 VUs    11.0s/30s
load   • [   0% ] waiting  19.0s

running (0m12.0s), 05/25 VUs, 550 complete and 0 interrupted iterations
warmup   [  40% ] 5 VUs    12.0s/30s
load   • [   0% ] waiting  18.0s

running (0m13.0s), 05/25 VUs, 595 complete and 0 interrupted iterations
warmup   [  43% ] 5 VUs    13.0s/30s
load   • [   0% ] waiting  17.0s

running (0m14.0s), 05/25 VUs, 645 complete and 0 interrupted iterations
warmup   [  47% ] 5 VUs    14.0s/30s
load   • [   0% ] waiting  16.0s

running (0m15.0s), 05/25 VUs, 690 complete and 0 interrupted iterations
warmup   [  50% ] 5 VUs    15.0s/30s
load   • [   0% ] waiting  15.0s

running (0m16.0s), 05/25 VUs, 740 complete and 0 interrupted iterations
warmup   [  53% ] 5 VUs    16.0s/30s
load   • [   0% ] waiting  14.0s

running (0m17.0s), 05/25 VUs, 785 complete and 0 interrupted iterations
warmup   [  57% ] 5 VUs    17.0s/30s
load   • [   0% ] waiting  13.0s

running (0m18.0s), 05/25 VUs, 830 complete and 0 interrupted iterations
warmup   [  60% ] 5 VUs    18.0s/30s
load   • [   0% ] waiting  12.0s

running (0m19.0s), 05/25 VUs, 875 complete and 0 interrupted iterations
warmup   [  63% ] 5 VUs    19.0s/30s
load   • [   0% ] waiting  11.0s

running (0m20.0s), 05/25 VUs, 925 complete and 0 interrupted iterations
warmup   [  67% ] 5 VUs    20.0s/30s
load   • [   0% ] waiting  10.0s

running (0m21.0s), 05/25 VUs, 970 complete and 0 interrupted iterations
warmup   [  70% ] 5 VUs    21.0s/30s
load   • [   0% ] waiting  09.0s

running (0m22.0s), 05/25 VUs, 1015 complete and 0 interrupted iterations
warmup   [  73% ] 5 VUs    22.0s/30s
load   • [   0% ] waiting  08.0s

running (0m23.0s), 05/25 VUs, 1060 complete and 0 interrupted iterations
warmup   [  77% ] 5 VUs    23.0s/30s
load   • [   0% ] waiting  07.0s

running (0m24.0s), 05/25 VUs, 1105 complete and 0 interrupted iterations
warmup   [  80% ] 5 VUs    24.0s/30s
load   • [   0% ] waiting  06.0s

running (0m25.0s), 05/25 VUs, 1151 complete and 0 interrupted iterations
warmup   [  83% ] 5 VUs    25.0s/30s
load   • [   0% ] waiting  05.0s

running (0m26.0s), 05/25 VUs, 1200 complete and 0 interrupted iterations
warmup   [  87% ] 5 VUs    26.0s/30s
load   • [   0% ] waiting  04.0s

running (0m27.0s), 05/25 VUs, 1245 complete and 0 interrupted iterations
warmup   [  90% ] 5 VUs    27.0s/30s
load   • [   0% ] waiting  03.0s

running (0m28.0s), 05/25 VUs, 1290 complete and 0 interrupted iterations
warmup   [  93% ] 5 VUs    28.0s/30s
load   • [   0% ] waiting  02.0s

running (0m29.0s), 05/25 VUs, 1339 complete and 0 interrupted iterations
warmup   [  97% ] 5 VUs    29.0s/30s
load   • [   0% ] waiting  01.0s

running (0m30.0s), 05/25 VUs, 1385 complete and 0 interrupted iterations
warmup   [ 100% ] 5 VUs    30.0s/30s
load   • [   0% ] waiting  00.0s

running (0m31.0s), 20/25 VUs, 1570 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   1% ] 20 VUs  0m01.0s/2m0s

running (0m32.0s), 20/25 VUs, 1770 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   2% ] 20 VUs  0m02.0s/2m0s

running (0m33.0s), 20/25 VUs, 1950 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   2% ] 20 VUs  0m03.0s/2m0s

running (0m34.0s), 20/25 VUs, 2130 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   3% ] 20 VUs  0m04.0s/2m0s

running (0m35.0s), 20/25 VUs, 2330 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   4% ] 20 VUs  0m05.0s/2m0s

running (0m36.0s), 20/25 VUs, 2510 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   5% ] 20 VUs  0m06.0s/2m0s

running (0m37.0s), 20/25 VUs, 2690 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   6% ] 20 VUs  0m07.0s/2m0s

running (0m38.0s), 20/25 VUs, 2890 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   7% ] 20 VUs  0m08.0s/2m0s

running (0m39.0s), 20/25 VUs, 3070 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   7% ] 20 VUs  0m09.0s/2m0s

running (0m40.0s), 20/25 VUs, 3270 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   8% ] 20 VUs  0m10.0s/2m0s

running (0m41.0s), 20/25 VUs, 3450 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   9% ] 20 VUs  0m11.0s/2m0s

running (0m42.0s), 20/25 VUs, 3650 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  10% ] 20 VUs  0m12.0s/2m0s

running (0m43.0s), 20/25 VUs, 3830 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  11% ] 20 VUs  0m13.0s/2m0s

running (0m44.0s), 20/25 VUs, 4030 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  12% ] 20 VUs  0m14.0s/2m0s

running (0m45.0s), 20/25 VUs, 4210 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  12% ] 20 VUs  0m15.0s/2m0s

running (0m46.0s), 20/25 VUs, 4402 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  13% ] 20 VUs  0m16.0s/2m0s

running (0m47.0s), 20/25 VUs, 4590 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  14% ] 20 VUs  0m17.0s/2m0s

running (0m48.0s), 20/25 VUs, 4770 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  15% ] 20 VUs  0m18.0s/2m0s

running (0m49.0s), 20/25 VUs, 4950 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  16% ] 20 VUs  0m19.0s/2m0s

running (0m50.0s), 20/25 VUs, 5150 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  17% ] 20 VUs  0m20.0s/2m0s

running (0m51.0s), 20/25 VUs, 5330 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  17% ] 20 VUs  0m21.0s/2m0s

running (0m52.0s), 20/25 VUs, 5510 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  18% ] 20 VUs  0m22.0s/2m0s

running (0m53.0s), 20/25 VUs, 5690 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  19% ] 20 VUs  0m23.0s/2m0s

running (0m54.0s), 20/25 VUs, 5890 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  20% ] 20 VUs  0m24.0s/2m0s

running (0m55.0s), 20/25 VUs, 6090 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  21% ] 20 VUs  0m25.0s/2m0s

running (0m56.0s), 20/25 VUs, 6270 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  22% ] 20 VUs  0m26.0s/2m0s

running (0m57.0s), 20/25 VUs, 6470 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  22% ] 20 VUs  0m27.0s/2m0s

running (0m58.0s), 20/25 VUs, 6650 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  23% ] 20 VUs  0m28.0s/2m0s

running (0m59.0s), 20/25 VUs, 6850 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  24% ] 20 VUs  0m29.0s/2m0s

running (1m00.0s), 20/25 VUs, 7050 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  25% ] 20 VUs  0m30.0s/2m0s

running (1m01.0s), 20/25 VUs, 7230 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  26% ] 20 VUs  0m31.0s/2m0s

running (1m02.0s), 20/25 VUs, 7410 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  27% ] 20 VUs  0m32.0s/2m0s

running (1m03.0s), 20/25 VUs, 7610 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  27% ] 20 VUs  0m33.0s/2m0s

running (1m04.0s), 20/25 VUs, 7810 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  28% ] 20 VUs  0m34.0s/2m0s

running (1m05.0s), 20/25 VUs, 7990 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  29% ] 20 VUs  0m35.0s/2m0s

running (1m06.0s), 20/25 VUs, 8190 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  30% ] 20 VUs  0m36.0s/2m0s

running (1m07.0s), 20/25 VUs, 8370 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  31% ] 20 VUs  0m37.0s/2m0s

running (1m08.0s), 20/25 VUs, 8550 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  32% ] 20 VUs  0m38.0s/2m0s

running (1m09.0s), 20/25 VUs, 8737 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  32% ] 20 VUs  0m39.0s/2m0s

running (1m10.0s), 20/25 VUs, 8930 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  33% ] 20 VUs  0m40.0s/2m0s

running (1m11.0s), 20/25 VUs, 9110 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  34% ] 20 VUs  0m41.0s/2m0s

running (1m12.0s), 20/25 VUs, 9310 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  35% ] 20 VUs  0m42.0s/2m0s

running (1m13.0s), 20/25 VUs, 9490 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  36% ] 20 VUs  0m43.0s/2m0s

running (1m14.0s), 20/25 VUs, 9670 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  37% ] 20 VUs  0m44.0s/2m0s

running (1m15.0s), 20/25 VUs, 9870 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  37% ] 20 VUs  0m45.0s/2m0s

running (1m16.0s), 20/25 VUs, 10050 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  38% ] 20 VUs  0m46.0s/2m0s

running (1m17.0s), 20/25 VUs, 10230 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  39% ] 20 VUs  0m47.0s/2m0s

running (1m18.0s), 20/25 VUs, 10430 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  40% ] 20 VUs  0m48.0s/2m0s

running (1m19.0s), 20/25 VUs, 10610 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  41% ] 20 VUs  0m49.0s/2m0s

running (1m20.0s), 20/25 VUs, 10790 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  42% ] 20 VUs  0m50.0s/2m0s

running (1m21.0s), 20/25 VUs, 10990 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  42% ] 20 VUs  0m51.0s/2m0s

running (1m22.0s), 20/25 VUs, 11170 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  43% ] 20 VUs  0m52.0s/2m0s

running (1m23.0s), 20/25 VUs, 11350 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  44% ] 20 VUs  0m53.0s/2m0s

running (1m24.0s), 20/25 VUs, 11548 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  45% ] 20 VUs  0m54.0s/2m0s

running (1m25.0s), 20/25 VUs, 11730 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  46% ] 20 VUs  0m55.0s/2m0s

running (1m26.0s), 20/25 VUs, 11910 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  47% ] 20 VUs  0m56.0s/2m0s

running (1m27.0s), 20/25 VUs, 12110 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  47% ] 20 VUs  0m57.0s/2m0s

running (1m28.0s), 20/25 VUs, 12290 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  48% ] 20 VUs  0m58.0s/2m0s

running (1m29.0s), 20/25 VUs, 12470 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  49% ] 20 VUs  0m59.0s/2m0s

running (1m30.0s), 20/25 VUs, 12670 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  50% ] 20 VUs  1m00.0s/2m0s

running (1m31.0s), 20/25 VUs, 12850 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  51% ] 20 VUs  1m01.0s/2m0s

running (1m32.0s), 20/25 VUs, 13030 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  52% ] 20 VUs  1m02.0s/2m0s

running (1m33.0s), 20/25 VUs, 13216 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  52% ] 20 VUs  1m03.0s/2m0s

running (1m34.0s), 20/25 VUs, 13410 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  53% ] 20 VUs  1m04.0s/2m0s

running (1m35.0s), 20/25 VUs, 13590 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  54% ] 20 VUs  1m05.0s/2m0s

running (1m36.0s), 20/25 VUs, 13790 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  55% ] 20 VUs  1m06.0s/2m0s

running (1m37.0s), 20/25 VUs, 13970 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  56% ] 20 VUs  1m07.0s/2m0s

running (1m38.0s), 20/25 VUs, 14150 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  57% ] 20 VUs  1m08.0s/2m0s

running (1m39.0s), 20/25 VUs, 14330 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  57% ] 20 VUs  1m09.0s/2m0s

running (1m40.0s), 20/25 VUs, 14530 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  58% ] 20 VUs  1m10.0s/2m0s

running (1m41.0s), 20/25 VUs, 14710 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  59% ] 20 VUs  1m11.0s/2m0s

running (1m42.0s), 20/25 VUs, 14890 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  60% ] 20 VUs  1m12.0s/2m0s

running (1m43.0s), 20/25 VUs, 15079 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  61% ] 20 VUs  1m13.0s/2m0s

running (1m44.0s), 20/25 VUs, 15270 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  62% ] 20 VUs  1m14.0s/2m0s

running (1m45.0s), 20/25 VUs, 15470 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  62% ] 20 VUs  1m15.0s/2m0s

running (1m46.0s), 20/25 VUs, 15650 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  63% ] 20 VUs  1m16.0s/2m0s

running (1m47.0s), 20/25 VUs, 15850 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  64% ] 20 VUs  1m17.0s/2m0s

running (1m48.0s), 20/25 VUs, 16031 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  65% ] 20 VUs  1m18.0s/2m0s

running (1m49.0s), 20/25 VUs, 16230 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  66% ] 20 VUs  1m19.0s/2m0s

running (1m50.0s), 20/25 VUs, 16410 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  67% ] 20 VUs  1m20.0s/2m0s

running (1m51.0s), 20/25 VUs, 16610 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  67% ] 20 VUs  1m21.0s/2m0s

running (1m52.0s), 20/25 VUs, 16790 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  68% ] 20 VUs  1m22.0s/2m0s

running (1m53.0s), 20/25 VUs, 16970 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  69% ] 20 VUs  1m23.0s/2m0s

running (1m54.0s), 20/25 VUs, 17152 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  70% ] 20 VUs  1m24.0s/2m0s

running (1m55.0s), 20/25 VUs, 17332 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  71% ] 20 VUs  1m25.0s/2m0s

running (1m56.0s), 20/25 VUs, 17532 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  72% ] 20 VUs  1m26.0s/2m0s

running (1m57.0s), 20/25 VUs, 17732 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  72% ] 20 VUs  1m27.0s/2m0s

running (1m58.0s), 20/25 VUs, 17912 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  73% ] 20 VUs  1m28.0s/2m0s

running (1m59.0s), 20/25 VUs, 18112 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  74% ] 20 VUs  1m29.0s/2m0s

running (2m00.0s), 20/25 VUs, 18312 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  75% ] 20 VUs  1m30.0s/2m0s

running (2m01.0s), 20/25 VUs, 18492 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  76% ] 20 VUs  1m31.0s/2m0s

running (2m02.0s), 20/25 VUs, 18692 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  77% ] 20 VUs  1m32.0s/2m0s

running (2m03.0s), 20/25 VUs, 18892 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  77% ] 20 VUs  1m33.0s/2m0s

running (2m04.0s), 20/25 VUs, 19092 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  78% ] 20 VUs  1m34.0s/2m0s

running (2m05.0s), 20/25 VUs, 19272 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  79% ] 20 VUs  1m35.0s/2m0s

running (2m06.0s), 20/25 VUs, 19472 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  80% ] 20 VUs  1m36.0s/2m0s

running (2m07.0s), 20/25 VUs, 19672 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  81% ] 20 VUs  1m37.0s/2m0s

running (2m08.0s), 20/25 VUs, 19872 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  82% ] 20 VUs  1m38.0s/2m0s

running (2m09.0s), 20/25 VUs, 20052 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  82% ] 20 VUs  1m39.0s/2m0s

running (2m10.0s), 20/25 VUs, 20252 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  83% ] 20 VUs  1m40.0s/2m0s

running (2m11.0s), 20/25 VUs, 20432 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  84% ] 20 VUs  1m41.0s/2m0s

running (2m12.0s), 20/25 VUs, 20632 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  85% ] 20 VUs  1m42.0s/2m0s

running (2m13.0s), 20/25 VUs, 20832 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  86% ] 20 VUs  1m43.0s/2m0s

running (2m14.0s), 20/25 VUs, 21032 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  87% ] 20 VUs  1m44.0s/2m0s

running (2m15.0s), 20/25 VUs, 21221 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  87% ] 20 VUs  1m45.0s/2m0s

running (2m16.0s), 20/25 VUs, 21412 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  88% ] 20 VUs  1m46.0s/2m0s

running (2m17.0s), 20/25 VUs, 21612 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  89% ] 20 VUs  1m47.0s/2m0s

running (2m18.0s), 20/25 VUs, 21812 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  90% ] 20 VUs  1m48.0s/2m0s

running (2m19.0s), 20/25 VUs, 21992 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  91% ] 20 VUs  1m49.0s/2m0s

running (2m20.0s), 20/25 VUs, 22177 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  92% ] 20 VUs  1m50.0s/2m0s

running (2m21.0s), 20/25 VUs, 22372 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  92% ] 20 VUs  1m51.0s/2m0s

running (2m22.0s), 20/25 VUs, 22561 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  93% ] 20 VUs  1m52.0s/2m0s

running (2m23.0s), 20/25 VUs, 22740 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  94% ] 20 VUs  1m53.0s/2m0s

running (2m24.0s), 20/25 VUs, 22940 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  95% ] 20 VUs  1m54.0s/2m0s

running (2m25.0s), 20/25 VUs, 23133 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  96% ] 20 VUs  1m55.0s/2m0s

running (2m26.0s), 20/25 VUs, 23324 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  97% ] 20 VUs  1m56.0s/2m0s

running (2m27.0s), 20/25 VUs, 23520 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  97% ] 20 VUs  1m57.0s/2m0s

running (2m28.0s), 20/25 VUs, 23720 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  98% ] 20 VUs  1m58.0s/2m0s

running (2m29.0s), 20/25 VUs, 23920 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  99% ] 20 VUs  1m59.0s/2m0s

running (2m30.0s), 20/25 VUs, 24104 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [ 100% ] 20 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration{endpoint:get_order,phase:load}
    ✓ 'p(95)<1000' p(95)=0s

    http_req_duration{endpoint:get_product,phase:load}
    ✓ 'p(95)<1000' p(95)=8.86ms

    http_req_duration{endpoint:get_stats,phase:load}
    ✓ 'p(95)<1000' p(95)=9.53ms

    http_req_duration{endpoint:place_order,phase:load}
    ✓ 'p(95)<2000' p(95)=8.6ms


  █ TOTAL RESULTS 

    checks_total.......: 24140   160.801761/s
    checks_succeeded...: 0.00%   0 out of 24140
    checks_failed......: 100.00% 24140 out of 24140

    ✗ product readable
      ↳  0% — ✓ 0 / ✗ 12004
    ✗ order accepted
      ↳  0% — ✓ 0 / ✗ 9736
    ✗ stats readable
      ↳  0% — ✓ 0 / ✗ 2400

    HTTP
    http_req_duration.......................: avg=3.83ms   min=287µs    med=3.01ms   max=84.24ms  p(90)=7.27ms   p(95)=9.02ms  
      { endpoint:get_order,phase:load }.....: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
      { endpoint:get_product,phase:load }...: avg=3.77ms   min=287µs    med=2.97ms   max=60.76ms  p(90)=7.21ms   p(95)=8.86ms  
      { endpoint:get_stats,phase:load }.....: avg=3.79ms   min=322µs    med=2.96ms   max=60.54ms  p(90)=7.4ms    p(95)=9.53ms  
      { endpoint:place_order,phase:load }...: avg=3.67ms   min=330µs    med=2.85ms   max=84.24ms  p(90)=6.87ms   p(95)=8.6ms   
    http_req_failed.........................: 100.00% 24142 out of 24142
    http_reqs...............................: 24142   160.815083/s

    EXECUTION
    iteration_duration......................: avg=105.67ms min=100.35ms med=104.24ms max=196.83ms p(90)=111.39ms p(95)=114.43ms
    iterations..............................: 24140   160.801761/s
    vus.....................................: 20      min=5              max=20
    vus_max.................................: 25      min=25             max=25

    NETWORK
    data_received...........................: 7.6 MB  51 kB/s
    data_sent...............................: 3.6 MB  24 kB/s



running (2m30.1s), 00/25 VUs, 24140 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load   ✓ [ 100% ] 20 VUs  2m0s

--- stderr ---